Конфигурация/Catalogs/ЭкземплярыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЭкземплярыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПредоставленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяСумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>90</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПриСохранении</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончательная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актуальная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ЭкземплярыОтчетов/Forms/Отчеты/Ext/Form/Module.bsl
#Область Внешний_интерфейс

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	// Обновляем организацию, очищаем отбор по счетам ДУ
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Договоры.Очистить();
	СоставОтчетов.ПолучитьЭлементы().Очистить();
	КлючевыеПоляПриИзменении(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	УстановитьЗаголовокОтборов();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация	= ПараметрыСеанса.ТекущаяОрганизация;
	Период		= Новый СтандартныйПериод(НачалоМесяца(ТекущаяДата()), КонецМесяца(ТекущаяДата()));
	
	Если Параметры.Свойство("Субъект") Тогда
		
		Если ТипЗнч(Параметры.Субъект) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
			
			ЭтаФорма.Договоры.Добавить(Параметры.Субъект);
			
			Элементы.ВидыДоговоров.Доступность	= Ложь;
			Элементы.Договоры.Доступность		= Ложь;
			
		Иначе
			
			ЭтаФорма.Клиенты.Добавить(Параметры.Субъект);
			
			Элементы.Клиенты.Доступность = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЭтаФорма.Клиенты.Количество() <> 0
		ИЛИ ЭтаФорма.ВидыДоговоров.Количество() <> 0
		ИЛИ ЭтаФорма.Договоры.Количество() <> 0 Тогда
		Настройки.Удалить("Клиенты");
		Настройки.Удалить("ВидыДоговоров");
		Настройки.Удалить("Договоры");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура СоставОтчетовПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СоставОтчетов.ВыделенныеСтроки.Количество() > 0
		И ЗначениеЗаполнено(СоставОтчетов.НайтиПоИдентификатору(Элементы.СоставОтчетов.ТекущаяСтрока).Экземпляр) Тогда
		ВывестиСведенияОбОтчетеНаСервере(Элементы.СоставОтчетов.ТекущаяСтрока);
	Иначе
		События.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобытияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаСобытия = События.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если СтрокаСобытия.КодСобытия >= 3 И СтрокаСобытия.КодСобытия <= 6 Тогда
		
		ДанныеОФайле = Новый Структура;
		
		ДанныеОФайле.Вставить("ИмяФайла",				СтрокаСобытия.ИмяПриСохранении);
		ДанныеОФайле.Вставить("ИдентификаторВерсии",	СтрокаСобытия.ИдентификаторВерсии);
		
		ОткрытьВерсиюОтчета(ДанныеОФайле);
		
	ИначеЕсли СтрокаСобытия.КодСобытия >= 7 И СтрокаСобытия.КодСобытия <= 17 Тогда
		ОткрытьЗначение(СтрокаСобытия.ПакетДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаДерева = СоставОтчетов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ВыбранноеЗначение = Неопределено;
	
	Если Поле.Имя = "СоставОтчетовПредставление" Тогда
		
		Если ЗначениеЗаполнено(СтрокаДерева.ИдентификаторВерсии) Тогда
			
			ДанныеОФайле = Новый Структура;
			
			ДанныеОФайле.Вставить("ИмяФайла",				СтрокаДерева.ИмяПриСохранении);
			ДанныеОФайле.Вставить("ИдентификаторВерсии",	СтрокаДерева.ИдентификаторВерсии);
			
			ОткрытьВерсиюОтчета(ДанныеОФайле);
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.Договор) Тогда
			ВыбранноеЗначение = СтрокаДерева.Договор;
		ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.Клиент) Тогда
			ВыбранноеЗначение = СтрокаДерева.Клиент;
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "СоставОтчетовСтатусВыгрузки" И ЗначениеЗаполнено(СтрокаДерева.Выгрузка) Тогда
		ВыбранноеЗначение = СтрокаДерева.Выгрузка;
	ИначеЕсли Поле.Имя = "СоставОтчетовСтатусОтправки" И ЗначениеЗаполнено(СтрокаДерева.Письмо) Тогда
		ВыбранноеЗначение = СтрокаДерева.Письмо;
	ИначеЕсли (Поле.Имя = "СоставОтчетовДоговор" ИЛИ Поле.Имя = "СоставОтчетовНомерДоговора") И ЗначениеЗаполнено(СтрокаДерева.Договор) Тогда
		ВыбранноеЗначение = СтрокаДерева.Договор;
	ИначеЕсли Поле.Имя = "СоставОтчетовКлиент" И ЗначениеЗаполнено(СтрокаДерева.Клиент) Тогда
		ВыбранноеЗначение = СтрокаДерева.Клиент;
	ИначеЕсли (Поле.Имя = "СоставОтчетовОтчет" ИЛИ Поле.Имя = "СоставОтчетовСтатусВерсии") И ЗначениеЗаполнено(СтрокаДерева.ИдентификаторВерсии) Тогда
		
		ДанныеОФайле = Новый Структура;
		
		ДанныеОФайле.Вставить("ИмяФайла",				СтрокаДерева.ИмяПриСохранении);
		ДанныеОФайле.Вставить("ИдентификаторВерсии",	СтрокаДерева.ИдентификаторВерсии);
		
		ОткрытьВерсиюОтчета(ДанныеОФайле);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ОткрытьЗначение(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеПоляПриИзменении(Элемент)
	
	ИзмененияКлючевыхПолейПрименены			= Ложь;
	Элементы.ДекорацияОбновление.Видимость	= Истина;
	УстановитьЗаголовокОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПорядокОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПолеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура ОчиститьОтбор(Команда)
	
	ЭтаФорма.Клиенты.Очистить();
	ЭтаФорма.ВидыДоговоров.Очистить();
	ЭтаФорма.Договоры.Очистить();
	ЭтаФорма.Отчеты.Очистить();
	
	ЭтаФорма.Периодичность		= Неопределено;
	ЭтаФорма.НаличиеВерсии		= 0;
	ЭтаФорма.ПоДоставке			= 0;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Элементы.СоставОтчетов.ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать хотя бы один отчет, который требуется вывести на печать!");
		Возврат;
	Иначе
		
		ДанныеОФайлах = Новый Массив;
		
		Для Каждого ИдентификаторСтроки Из Элементы.СоставОтчетов.ВыделенныеСтроки Цикл
			
			СтрокаТаблицы = СоставОтчетов.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторВерсии) Тогда
				
				ДанныеОФайле = Новый Структура;
				
				ДанныеОФайле.Вставить("Отчет",					СтрокаТаблицы.Отчет);
				ДанныеОФайле.Вставить("Периодичность",			СтрокаТаблицы.Периодичность);
				ДанныеОФайле.Вставить("Договор",				СтрокаТаблицы.Договор);
				ДанныеОФайле.Вставить("Дата",					СтрокаТаблицы.Дата);
				ДанныеОФайле.Вставить("ИмяФайла",				СтрокаТаблицы.ИмяПриСохранении);
				ДанныеОФайле.Вставить("ИдентификаторВерсии",	СтрокаТаблицы.ИдентификаторВерсии);
				
				ДанныеОФайлах.Добавить(ДанныеОФайле);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДанныеОФайлах.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать хотя бы один отчет с сохраненной версией, которую требуется вывести на печать!");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ФайлыДляВыводаНаПечать = Новый Массив;
	
	ПолучитьДанныеВерсийНаСервере(ДанныеОФайлах);
	
	Каталог = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + "\";
	
	Для Каждого ДанныеОФайле Из ДанныеОФайлах Цикл
		
		Если НЕ ДанныеОФайле.Свойство("Адрес") Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеОФайле.Адрес);
		Исключение
			
			ТекстОшибки = СтрШаблон("Отчет %1 (%2) по %3 за %4 не будет открыт из-за ошибки при получении версии отчета из временного хранилища:%5",
									ДанныеОФайле.Отчет,
									ДанныеОФайле.Периодичность,
									ДанныеОФайле.Договор,
									Формат(ДанныеОФайле.Дата, "ДФ=dd.MM.yyyy"),
									Символы.ПС + ОписаниеОшибки());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			Продолжить;
			
		КонецПопытки;
		
		Попытка
			ДвоичныеДанные.Записать(Каталог + ДанныеОФайле.ИмяФайла);
		Исключение
			
			ТекстОшибки = СтрШаблон("Отчет %1 (%2) по %3 за %4 не будет выведен на печать из-за ошибки при записи временного файла:%5",
									ДанныеОФайле.Отчет,
									ДанныеОФайле.Периодичность,
									ДанныеОФайле.Договор,
									Формат(ДанныеОФайле.Дата, "ДФ=dd.MM.yyyy"),
									Символы.ПС + ОписаниеОшибки());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			Продолжить;
			
		КонецПопытки;
		
		Попытка
			РаботаСОтчетамиКлиент.НапечататьФайл(Каталог + ДанныеОФайле.ИмяФайла);
		Исключение
			
			ТекстОшибки = СтрШаблон("Отчет %1 (%2) по %3 за %4 не выведен на печать из-за ошибки при вызове функции печати:%6",
									ДанныеОФайле.Отчет,
									ДанныеОФайле.Периодичность,
									ДанныеОФайле.Договор,
									Формат(ДанныеОФайле.Дата, "ДФ=dd.MM.yyyy"),
									Символы.ПС + ОписаниеОшибки());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			Продолжить;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОтчеты(Команда)
	
	ОбновитьОтчетыНаСервере();
	УстановитьЗаголовокОтборов();	
	
	ИзмененияКлючевыхПолейПрименены			= Истина;
	Элементы.ДекорацияОбновление.Видимость	= Ложь;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВКаталог(Команда)
	
	Если Элементы.СоставОтчетов.ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать хотя бы один отчет, версию которого требуется выгрузить!");
		Возврат;
	Иначе
		
		ДанныеОФайлах = Новый Массив;
		
		Для Каждого ИдентификаторСтроки Из Элементы.СоставОтчетов.ВыделенныеСтроки Цикл
			
			СтрокаТаблицы = СоставОтчетов.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторВерсии) Тогда
				
				ДанныеОФайле = Новый Структура;
				
				ДанныеОФайле.Вставить("Отчет",					СтрокаТаблицы.Отчет);
				ДанныеОФайле.Вставить("Периодичность",			СтрокаТаблицы.Периодичность);
				ДанныеОФайле.Вставить("Договор",				СтрокаТаблицы.Договор);
				ДанныеОФайле.Вставить("Дата",					СтрокаТаблицы.Дата);
				ДанныеОФайле.Вставить("ИмяФайла",				СтрокаТаблицы.ИмяПриСохранении);
				ДанныеОФайле.Вставить("ИдентификаторВерсии",	СтрокаТаблицы.ИдентификаторВерсии);
				
				ДанныеОФайлах.Добавить(ДанныеОФайле);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДанныеОФайлах.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать хотя бы один отчет с сохраненной версией, которую требуется выгрузить!");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если ДВФ.Выбрать() Тогда
		
		ПолучитьДанныеВерсийНаСервере(ДанныеОФайлах);
		
		Для Каждого ДанныеОФайле Из ДанныеОФайлах Цикл
			
			Если НЕ ДанныеОФайле.Свойство("Адрес") Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеОФайле.Адрес);
			Исключение
				
				ТекстОшибки = СтрШаблон("Отчет %1 (%2) по %3 за %4 не выгружен из-за ошибки при получении версии отчета из временного хранилища:%5",
										ДанныеОФайле.Отчет,
										ДанныеОФайле.Периодичность,
										ДанныеОФайле.Договор,
										Формат(ДанныеОФайле.Дата, "ДФ=dd.MM.yyyy"),
										Символы.ПС + ОписаниеОшибки());
										
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				
				Продолжить;
				
			КонецПопытки;
			
			Попытка
				ДвоичныеДанные.Записать(ДВФ.Каталог + ?(Прав(ДВФ.Каталог, 1) = "\", "", "\") + ДанныеОФайле.ИмяФайла);
			Исключение
				
				ТекстОшибки = СтрШаблон("Отчет %1 (%2) по %3 за %4 не выгружен из-за ошибки при записи файла:%5",
										ДанныеОФайле.Отчет,
										ДанныеОФайле.Периодичность,
										ДанныеОФайле.Договор,
										Формат(ДанныеОФайле.Дата, "ДФ=dd.MM.yyyy"),
										Символы.ПС + ОписаниеОшибки());
										
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				
				Продолжить;
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	Если Элементы.СоставОтчетов.ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать хотя бы один отчет, который требуется открыть!");
		Возврат;
	Иначе
		
		ДанныеОФайлах = Новый Массив;
		
		Для Каждого ИдентификаторСтроки Из Элементы.СоставОтчетов.ВыделенныеСтроки Цикл
			
			СтрокаТаблицы = СоставОтчетов.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторВерсии) Тогда
				
				ДанныеОФайле = Новый Структура;
				
				ДанныеОФайле.Вставить("Отчет",					СтрокаТаблицы.Отчет);
				ДанныеОФайле.Вставить("Периодичность",			СтрокаТаблицы.Периодичность);
				ДанныеОФайле.Вставить("Договор",				СтрокаТаблицы.Договор);
				ДанныеОФайле.Вставить("Дата",					СтрокаТаблицы.Дата);
				ДанныеОФайле.Вставить("ИмяФайла",				СтрокаТаблицы.ИмяПриСохранении);
				ДанныеОФайле.Вставить("ИдентификаторВерсии",	СтрокаТаблицы.ИдентификаторВерсии);
				
				ДанныеОФайлах.Добавить(ДанныеОФайле);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДанныеОФайлах.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать хотя бы один отчет с сохраненной версией, которую требуется открыть!");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПолучитьДанныеВерсийНаСервере(ДанныеОФайлах);
	
	Для Каждого ДанныеОФайле Из ДанныеОФайлах Цикл
		
		Если НЕ ДанныеОФайле.Свойство("Адрес") Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеОФайле.Адрес);
		Исключение
			
			ТекстОшибки = СтрШаблон("Отчет %1 (%2) по %3 за %4 не будет открыт из-за ошибки при получении версии отчета из временного хранилища:%5",
									ДанныеОФайле.Отчет,
									ДанныеОФайле.Периодичность,
									ДанныеОФайле.Договор,
									Формат(ДанныеОФайле.Дата, "ДФ=dd.MM.yyyy"),
									Символы.ПС + ОписаниеОшибки());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			Продолжить;
			
		КонецПопытки;
		
		Каталог = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов();
		
		Попытка
			ДвоичныеДанные.Записать(Каталог + ДанныеОФайле.ИмяФайла);
		Исключение
			
			ТекстОшибки = СтрШаблон("Отчет %1 (%2) по %3 за %4 не будет открыт из-за ошибки при записи временного файла:%5",
									ДанныеОФайле.Отчет,
									ДанныеОФайле.Периодичность,
									ДанныеОФайле.Договор,
									Формат(ДанныеОФайле.Дата, "ДФ=dd.MM.yyyy"),
									Символы.ПС + ОписаниеОшибки());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			Продолжить;
			
		КонецПопытки;
		
		ЗапуститьПриложение(Каталог + ДанныеОФайле.ИмяФайла);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Для Каждого Строка Из СоставОтчетов.ПолучитьЭлементы() Цикл
		Элементы.СоставОтчетов.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Для Каждого Строка Из СоставОтчетов.ПолучитьЭлементы() Цикл
		СвернутьВетку(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаПочту(Команда)
	
	Вложения = Новый Массив;
	
	Для Каждого Строка Из Элементы.СоставОтчетов.ВыделенныеСтроки Цикл
		
		СтрокаТаблицы = СоставОтчетов.НайтиПоИдентификатору(Строка);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторВерсии)
			 ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.ИмяПриСохранении) Тогда
			 Продолжить;
		КонецЕсли;
		
		НовоеВложение = Новый Структура;
		
		НовоеВложение.Вставить("Идентификатор",	СтрокаТаблицы.ИдентификаторВерсии);
		НовоеВложение.Вставить("Имя",			СтрокаТаблицы.ИмяПриСохранении);
		НовоеВложение.Вставить("Экземпляр",		СтрокаТаблицы.Экземпляр);
		
		Вложения.Добавить(НовоеВложение);
		
	КонецЦикла;
	
	Если Вложения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для отправки! Выберите строки с отчетами, по которым есть сохраненные версии.");
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуМодально("ОбщаяФорма.ОтправкаФайловПочтой", Новый Структура("Организация, Вложения", ЭтотОбъект.Организация, Вложения));
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

#Область Клиентские

&НаКлиенте
Процедура УстановитьЗаголовокОтборов()
	
	Если ЭтаФорма.Клиенты.Количество() > 0
		ИЛИ ЭтаФорма.ВидыДоговоров.Количество() > 0
		ИЛИ ЭтаФорма.Договоры.Количество() > 0
		ИЛИ ЭтаФорма.Отчеты.Количество() > 0
		ИЛИ ЗначениеЗаполнено(ЭтаФорма.Периодичность) Тогда
		ЭтаФорма.ЗаголовокОтборов = "установлен";
	Иначе
		ЭтаФорма.ЗаголовокОтборов = "не задан";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВерсиюОтчета(ДанныеОФайле)
	
	// Получаем версию из хранилища
	Попытка
		Адрес = ПолучитьДанныеВерсииНаСервере(ДанныеОФайле.ИдентификаторВерсии);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось открыть версию отчета из-за ошибки: %1", ОписаниеОшибки()));
		Возврат;
	КонецПопытки;
	
	Попытка
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось открыть версию из-за ошибки при получении данных из временного хранилища: %1", ОписаниеОшибки()));
		Возврат;
	КонецПопытки;
	
	Попытка
		УдалитьИзВременногоХранилища(Адрес);
	Исключение
		// Ну, не удалили и не удалили
	КонецПопытки;
	
	// Сохраняем версию во временный файл
	Каталог = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов();
	
	ИмяФайла = СтрШаблон("%1%2\%3",
						Каталог + ?(Прав(Каталог, 1) = "\", "", "\"),
						Строка(Новый УникальныйИдентификатор),
						ДанныеОФайле.ИмяФайла);
	
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось открыть версию из-за ошибки при сохранении временного файла: %1", ОписаниеОшибки()));
		Возврат;
	КонецПопытки;
	
	// Открываем файл
	ЗапуститьПриложение(ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.СоставОтчетовПредставление.Видимость	= ЭтаФорма.Группировать;
	Элементы.СоставОтчетовКлиент.Видимость			= НЕ ЭтаФорма.Группировать И ЭтаФорма.Клиенты.Количество() <> 1;
	Элементы.СоставОтчетовВидДоговора.Видимость		= НЕ ЭтаФорма.Группировать И ЭтаФорма.Клиенты.Количество() <> 1;
	Элементы.СоставОтчетовДоговор.Видимость			= НЕ ЭтаФорма.Группировать;
	Элементы.СоставОтчетовНомерДоговора.Видимость	= НЕ ЭтаФорма.Группировать;
	Элементы.СоставОтчетовОтчет.Видимость			= НЕ ЭтаФорма.Группировать;
	Элементы.СоставОтчетовПериодичность.Видимость	= НЕ ЭтаФорма.Группировать;
	Элементы.ГруппаСортировка.Видимость				= НЕ ЭтаФорма.Группировать;
	Элементы.РазвернутьВсе.Видимость				= ЭтаФорма.Группировать;
	Элементы.СвернутьВсе.Видимость					= ЭтаФорма.Группировать;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВетку(Ветка)
	
	Для Каждого ДочерняяВетка Из Ветка.ПолучитьЭлементы() Цикл
		СвернутьВетку(ДочерняяВетка);
	КонецЦикла;
	
	Элементы.СоставОтчетов.Свернуть(Ветка.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область Серверные

&НаСервере
Функция ЗарегистрироватьНачалоСессииСбораСтатистики(ИмяПроцедуры)
	
	ПоляДляСтатистики = "Организация, Период, Группировать, ГруппаОтчетов";
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, ПоляДляСтатистики);
	Механизм			= СтрШаблон("%1.%2", ЭтотОбъект.ИмяФормы, ИмяПроцедуры);
	СессияСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
	
	Возврат Новый Структура("Механизм, Сессия, СтатистикаВыполнения", Механизм, СессияСтатистики, Новый Массив);
	
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессииСбораСтатистики(СессияСбораСтатистики)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(СессияСбораСтатистики.Механизм, СессияСбораСтатистики.Сессия);
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтборНаСервере()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация", Организация);
	
	// Виды договоров
	Если Клиенты.Количество() > 0 Тогда
		Результат.Вставить("Клиенты", Клиенты.ВыгрузитьЗначения());
	КонецЕсли;
	
	// Виды договоров
	Если ВидыДоговоров.Количество() > 0 Тогда
		Результат.Вставить("ВидыДоговоров", ВидыДоговоров.ВыгрузитьЗначения());
	КонецЕсли;
	
	// Договоры
	Если Договоры.Количество() > 0 Тогда
		Результат.Вставить("Договоры", Договоры.ВыгрузитьЗначения());
	КонецЕсли;
	
	// Группа отчетов
	Если ЗначениеЗаполнено(ГруппаОтчетов) Тогда
		Результат.Вставить("ГруппаОтчетов", ГруппаОтчетов);
	КонецЕсли;
	
	// Отчеты
	Если Отчеты.Количество() > 0 Тогда
		Результат.Вставить("Отчеты", Отчеты.ВыгрузитьЗначения());
	КонецЕсли;
	
	// Периодичность
	Если ЗначениеЗаполнено(Периодичность) Тогда
		Результат.Вставить("Периодичность", Периодичность);
	КонецЕсли;
	
	// Начало периода
	Если ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		Результат.Вставить("НачалоПериода", Период.ДатаНачала);
	КонецЕсли;
	
	// Конец периода
	Если ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Результат.Вставить("КонецПериода", Период.ДатаОкончания);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УдалитьСтрокуНаСервере(Идентификатор)
	
	Строка = СоставОтчетов.НайтиПоИдентификатору(Идентификатор);
	
	Родитель = Строка.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		СоставОтчетов.ПолучитьЭлементы().Удалить(Строка);
	Иначе
		
		Родитель.ПолучитьЭлементы().Удалить(Строка);
		
		Если Родитель.ПолучитьЭлементы().Количество() = 0 Тогда
			УдалитьСтрокуНаСервере(Родитель.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтчетыНаСервере()
	
	СессияСбораСтатистики = ЗарегистрироватьНачалоСессииСбораСтатистики("ОбновитьОтчетыНаСервере()");
	
	СоставОтчетов.ПолучитьЭлементы().Очистить();
	
	СтрокиКПолучениюСтатусовИНастроек = Новый ТаблицаЗначений;
	
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("Субъект",					Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("Отчет",						Новый ОписаниеТипов("СправочникСсылка.Отчеты"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("КлючОтчета",				Новый ОписаниеТипов("Строка"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("Периодичность",				Новый ОписаниеТипов("ПеречислениеСсылка.ПериодичностьПредоставленияОтчетности"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("Дата",						Новый ОписаниеТипов("Дата"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("ДатаНачала",				Новый ОписаниеТипов("Дата"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("ДатаОкончания",				Новый ОписаниеТипов("Дата"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("ОтправляетсяПочтой",		Новый ОписаниеТипов("Булево"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("ВыгружаетсяВЭДО",			Новый ОписаниеТипов("Булево"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("РучнаяЗагрузкаФайловВЭДО",	Новый ОписаниеТипов("Булево"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("Регламентированный",		Новый ОписаниеТипов("Булево"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("ВалютаДокумента",			Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("ОтчетЗаПоследнийКвартал",	Новый ОписаниеТипов("Булево"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("ВыбраннаяФорма",			Новый ОписаниеТипов("Строка"));
	СтрокиКПолучениюСтатусовИНастроек.Колонки.Добавить("ИдентификаторСтроки",		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36, ДопустимаяДлина.Фиксированная)));
	
	ИдентификаторыСтрок = Новый Соответствие;
	
	ВыборкаКлиенты = Справочники.ЭкземплярыОтчетов.ПолучитьОтчетыЗаПериод(СформироватьОтборНаСервере());
	
	Индекс = 0;
	
	Пока ВыборкаКлиенты.Следующий() Цикл
		
		Если ЭтаФорма.Клиенты.Количество() = 1 ИЛИ НЕ Группировать Тогда
			КоллекцияВидовДоговоров = СоставОтчетов.ПолучитьЭлементы();
		Иначе
			
			СтрокаКлиент = СоставОтчетов.ПолучитьЭлементы().Добавить();
			
			СтрокаКлиент.Представление	= Строка(ВыборкаКлиенты.Клиент);
			СтрокаКлиент.Клиент			= ВыборкаКлиенты.Клиент;
			
			КоллекцияВидовДоговоров = СтрокаКлиент.ПолучитьЭлементы();
			
		КонецЕсли;
		
		ВыборкаВидыДоговоров = ВыборкаКлиенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВидыДоговоров.Следующий() Цикл
			
			Если ЭтаФорма.Договоры.Количество() <> 1 И ЭтаФорма.ВидыДоговоров.Количество() <> 1 И Группировать Тогда
				
				СтрокаВидДоговора = КоллекцияВидовДоговоров.Добавить();
				
				СтрокаВидДоговора.Представление	= ВыборкаВидыДоговоров.ВидДоговора;
				
				КоллекцияДоговоров = СтрокаВидДоговора.ПолучитьЭлементы();
				
			Иначе
				КоллекцияДоговоров = КоллекцияВидовДоговоров;
			КонецЕсли;
			
			ВыборкаДоговоры = ВыборкаВидыДоговоров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДоговоры.Следующий() Цикл
				
				Если ЭтаФорма.Договоры.Количество() <> 1 И Группировать Тогда
					
					СтрокаДоговор = КоллекцияДоговоров.Добавить();
					
					СтрокаДоговор.Представление	= Строка(ВыборкаДоговоры.Договор);
					СтрокаДоговор.Договор		= ВыборкаДоговоры.Договор;
					
					КоллекцияГруппОтчетов = СтрокаДоговор.ПолучитьЭлементы();
					
				Иначе
					КоллекцияГруппОтчетов = КоллекцияВидовДоговоров;
				КонецЕсли;
				
				ВыборкаГруппыОтчетов = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаГруппыОтчетов.Следующий() Цикл
					
					Если ЗначениеЗаполнено(ГруппаОтчетов) ИЛИ НЕ Группировать Тогда
						КоллекцияГодов = КоллекцияГруппОтчетов;
					Иначе
						
						СтрокаГруппаОтчетов = КоллекцияГруппОтчетов.Добавить();
						
						СтрокаГруппаОтчетов.Представление = Строка(ВыборкаГруппыОтчетов.ГруппаОтчетов);
						
						КоллекцияГодов = СтрокаГруппаОтчетов.ПолучитьЭлементы();
						
					КонецЕсли;
					
					ВыборкаГоды = ВыборкаГруппыОтчетов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаГоды.Следующий() Цикл
						
						Если Группировать Тогда
							
							СтрокаГод = КоллекцияГодов.Добавить();
							
							СтрокаГод.Представление = Формат(ВыборкаГоды.Год, "ЧГ=0");
							
							КоллекцияМесяцев = СтрокаГод.ПолучитьЭлементы();
							
						Иначе
							КоллекцияМесяцев = КоллекцияГодов;
						КонецЕсли;
						
						ВыборкаМесяцы = ВыборкаГоды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаМесяцы.Следующий() Цикл
							
							Если Группировать Тогда
								
								СтрокаМесяц = КоллекцияМесяцев.Добавить();
								
								СтрокаМесяц.Представление = Формат(Дата(ВыборкаМесяцы.Год, ВыборкаМесяцы.Месяц, 1), "ДФ=MMMM");
								
								КоллекцияПериодичностей = СтрокаМесяц.ПолучитьЭлементы();
								
							Иначе
								КоллекцияПериодичностей = КоллекцияМесяцев;
							КонецЕсли;
							
							ВыборкаПериодичности = ВыборкаМесяцы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыборкаПериодичности.Следующий() Цикл
								
								Если ЗначениеЗаполнено(Периодичность) ИЛИ НЕ Группировать Тогда
									КоллекцияЭкземпляров = КоллекцияПериодичностей;
								Иначе
									
									СтрокаПериодичность = КоллекцияПериодичностей.Добавить();
									
									СтрокаПериодичность.Представление = Строка(ВыборкаПериодичности.Периодичность);
									
									КоллекцияЭкземпляров = СтрокаПериодичность.ПолучитьЭлементы();
									
								КонецЕсли;
								
								ВыборкаЭкземпляры = ВыборкаПериодичности.Выбрать();
								
								Пока ВыборкаЭкземпляры.Следующий() Цикл
									
									СтрокаЭкземпляр = КоллекцияЭкземпляров.Добавить();
									
									ЗаполнитьЗначенияСвойств(СтрокаЭкземпляр, ВыборкаЭкземпляры);
									
									СтрокаЭкземпляр.ИсходныйПорядковыйНомер	= Индекс;
									СтрокаЭкземпляр.Представление			= Строка(ВыборкаЭкземпляры.Отчет);
									СтрокаЭкземпляр.ОбработкаЗавершена		= 1;
									СтрокаЭкземпляр.ИдентификаторСтроки		= Строка(Новый УникальныйИдентификатор);
									
									СтрокаКПолучениюДанных = СтрокиКПолучениюСтатусовИНастроек.Добавить();
									
									СтрокаКПолучениюДанных.Субъект				= СтрокаЭкземпляр.Договор;
									СтрокаКПолучениюДанных.Отчет				= СтрокаЭкземпляр.Отчет;
									СтрокаКПолучениюДанных.Периодичность		= СтрокаЭкземпляр.Периодичность;
									СтрокаКПолучениюДанных.Дата					= СтрокаЭкземпляр.Дата;
									СтрокаКПолучениюДанных.ИдентификаторСтроки	= СтрокаЭкземпляр.ИдентификаторСтроки;
									
									ИдентификаторыСтрок.Вставить(СтрокаЭкземпляр.ИдентификаторСтроки, СтрокаЭкземпляр.ПолучитьИдентификатор());
									
									Индекс = Индекс + 1;
									
								КонецЦикла;
								
							КонецЦикла;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	УдаляемыеСтроки = Новый Массив;
	
	Настройки = Новый Массив;
	
	Настройки.Добавить("АвтоматическаяВыгрузкаВЭДО");
	Настройки.Добавить("РучнаяЗагрузкаФайловВЭДО");
	Настройки.Добавить("АвтоматическаяОтправка");
	
	// Для быстрого поиска строки таблицы по сборному ключу
	СоответствиеСтрок = Новый Соответствие;
	Для Каждого ДанныеОтчета Из СтрокиКПолучениюСтатусовИНастроек Цикл
		СоответствиеСтрок.Вставить(СтрШаблон("%1-%2-%3-%4", ДанныеОтчета.Дата, ДанныеОтчета.Субъект, ДанныеОтчета.Отчет, ДанныеОтчета.Периодичность), ДанныеОтчета);	
	КонецЦикла;
	
	ЗначенияНастроек = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчетов(СтрокиКПолучениюСтатусовИНастроек, Настройки);
	
	Для Каждого СтрокаНастроек Из ЗначенияНастроек Цикл
		
		ИсходнаяСтрока = СоответствиеСтрок.Получить(СтрШаблон("%1-%2-%3-%4", СтрокаНастроек.Дата, СтрокаНастроек.Субъект, СтрокаНастроек.Отчет, СтрокаНастроек.Периодичность));	
		Если ИсходнаяСтрока = Неопределено Тогда
			ВызватьИсключение "Не удалось найти строку исходной таблицы по сборному ключу";
		КонецЕсли;	
		
		ИсходнаяСтрока.ВыгружаетсяВЭДО			= СтрокаНастроек.Настройки.АвтоматическаяВыгрузкаВЭДО;
		ИсходнаяСтрока.ОтправляетсяПочтой		= СтрокаНастроек.Настройки.АвтоматическаяОтправка;
		ИсходнаяСтрока.РучнаяЗагрузкаФайловВЭДО	= СтрокаНастроек.Настройки.РучнаяЗагрузкаФайловВЭДО;
		
	КонецЦикла;	
	
	СостоянияОтчетов = РаботаСОтчетами.ПолучитьСостоянияОтчетов(Организация, СтрокиКПолучениюСтатусовИНастроек);
	
	Для Каждого Состояние Из СостоянияОтчетов Цикл
		
		СтрокаЭкземпляр = СоставОтчетов.НайтиПоИдентификатору(ИдентификаторыСтрок.Получить(Состояние.ИдентификаторСтроки));
		
		ЗаполнитьЗначенияСвойств(СтрокаЭкземпляр, Состояние);
		
		Если Состояние.ОбработкаЗавершена Тогда
			СтрокаЭкземпляр.ОбработкаЗавершена = 2;
		Иначе
			СтрокаЭкземпляр.ОбработкаЗавершена = 1;
		КонецЕсли;
		
		СтрокаЭкземпляр.СтатусВерсии = СтрокаЭкземпляр.СтатусВерсии + 1;
		
		Если НаличиеВерсии = 1 И СтрокаЭкземпляр.СтатусВерсии < 2
			ИЛИ НаличиеВерсии = 2 И СтрокаЭкземпляр.СтатусВерсии > 1
			ИЛИ ПоДоставке = 1 И СтрокаЭкземпляр.СтатусВыгрузки < 4
			ИЛИ ПоДоставке = 2 И СтрокаЭкземпляр.СтатусОтправки < 4
			ИЛИ ПоДоставке = 3 И (СтрокаЭкземпляр.СтатусВыгрузки < 4 ИЛИ СтрокаЭкземпляр.СтатусОтправки < 4) Тогда
			УдаляемыеСтроки.Добавить(ИдентификаторыСтрок.Получить(Состояние.ИдентификаторСтроки));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Идентификатор ИЗ УдаляемыеСтроки Цикл
		УдалитьСтрокуНаСервере(Идентификатор);
	КонецЦикла;
	
	Если НЕ ЭтаФорма.Группировать
		И Сортировка.Количество() > 0 Тогда
		ПрименитьСортировкуНаСервере();
	КонецЕсли;
	
	ЗарегистрироватьОкончаниеСессииСбораСтатистики(СессияСбораСтатистики);
	
КонецПроцедуры
&НаСервере
Процедура ВывестиСведенияОбОтчетеНаСервере(ИдентификаторСтроки)
	
	Экземпляр = СоставОтчетов.НайтиПоИдентификатору(ИдентификаторСтроки).Экземпляр;
	
	События.Загрузить(РаботаСОтчетами.ПолучитьСобытияСОтчетом(Экземпляр));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеВерсииНаСервере(ИдентификаторВерсии)
	
	Попытка
		ДанныеВерсии = РаботаСФайловымХранилищем.ПолучитьВерсиюФайла(ИдентификаторВерсии);
	Исключение
		ВызватьИсключение "Не удалось получить данные версии отчета из файлового хранилища!";
	КонецПопытки;
	
	Возврат ДанныеВерсии.Адрес;
	
КонецФункции

&НаСервере
Процедура ПолучитьДанныеВерсийНаСервере(ДанныеОФайлах)
	
	Для Каждого ДанныеОФайле Из ДанныеОФайлах Цикл
		
		Попытка
			ДанныеВерсии = ПолучитьДанныеВерсииНаСервере(ДанныеОФайле.ИдентификаторВерсии);
		Исключение
			
			ТекстОшибки = СтрШаблон("Не удалось получить данные версии отчета %1 (%2) по %3 за %4 из-за ошибки:%5",
									ДанныеОФайле.Отчет,
									ДанныеОФайле.Периодичность,
									ДанныеОФайле.Договор,
									Формат(ДанныеОФайле.Дата, "ДФ=dd.MM.yyyy"),
									Символы.ПС + ОписаниеОшибки());
									
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			Продолжить;
			
		КонецПопытки;
		
		ДанныеОФайле.Вставить("Адрес", ДанныеВерсии);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьСортировкуНаСервере()
	
	ТаблицаДляСортировки = Новый ТаблицаЗначений;
	
	ТипыКлиента = Новый Массив;
	
	ТипыКлиента.Добавить(Тип("СправочникСсылка.ЮрФизЛица"));
	ТипыКлиента.Добавить(Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды"));
	
	ТаблицаДляСортировки.Колонки.Добавить("Представление",				Новый ОписаниеТипов("Строка"));
	ТаблицаДляСортировки.Колонки.Добавить("Клиент",						Новый ОписаниеТипов(ТипыКлиента));
	ТаблицаДляСортировки.Колонки.Добавить("ВидДоговора",				Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления"));
	ТаблицаДляСортировки.Колонки.Добавить("Договор",					Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ТаблицаДляСортировки.Колонки.Добавить("ГруппаОтчетов",				Новый ОписаниеТипов("СправочникСсылка.Отчеты"));
	ТаблицаДляСортировки.Колонки.Добавить("Периодичность",				Новый ОписаниеТипов("ПеречислениеСсылка.ПериодичностьПредоставленияОтчетности"));
	ТаблицаДляСортировки.Колонки.Добавить("Дата",						Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаДляСортировки.Колонки.Добавить("Отчет",						Новый ОписаниеТипов("СправочникСсылка.Отчеты"));
	ТаблицаДляСортировки.Колонки.Добавить("Экземпляр",					Новый ОписаниеТипов("СправочникСсылка.ЭкземплярыОтчетов"));
	ТаблицаДляСортировки.Колонки.Добавить("ОбработкаЗавершена",			Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДляСортировки.Колонки.Добавить("ЗапретОбработки",			Новый ОписаниеТипов("Булево"));
	ТаблицаДляСортировки.Колонки.Добавить("СтатусВерсии",				Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДляСортировки.Колонки.Добавить("СтатусВыгрузки",				Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДляСортировки.Колонки.Добавить("СтатусОтправки",				Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДляСортировки.Колонки.Добавить("ИдентификаторСтроки",		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36, ДопустимаяДлина.Переменная)));
	ТаблицаДляСортировки.Колонки.Добавить("Выгрузка",					Новый ОписаниеТипов("СправочникСсылка.ПакетыДанныхКОбработке"));
	ТаблицаДляСортировки.Колонки.Добавить("Письмо",						Новый ОписаниеТипов("СправочникСсылка.ПакетыДанныхКОбработке"));
	ТаблицаДляСортировки.Колонки.Добавить("ИдентификаторВерсии",		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36, ДопустимаяДлина.Переменная)));
	ТаблицаДляСортировки.Колонки.Добавить("ИмяПриСохранении",			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(260, ДопустимаяДлина.Переменная)));
	ТаблицаДляСортировки.Колонки.Добавить("НомерДоговора",				Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(70, ДопустимаяДлина.Переменная)));
	ТаблицаДляСортировки.Колонки.Добавить("ИсходныйПорядковыйНомер",	Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Для Каждого Строка Из СоставОтчетов.ПолучитьЭлементы() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДляСортировки.Добавить(), Строка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаОтчетов", ТаблицаДляСортировки);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ <ПоляТаблицы>
		|ПОМЕСТИТЬ _ТаблицаОтчетов
		|ИЗ
		|	&ТаблицаОтчетов КАК ТаблицаОтчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ <ПоляТаблицы>
		|ИЗ
		|	_ТаблицаОтчетов КАК _ТаблицаОтчетов
		|
		|УПОРЯДОЧИТЬ ПО <ПоляСортировки>";
	
	ПоляТаблицы = "";
	
	Для Каждого Колонка Из ТаблицаДляСортировки.Колонки Цикл
		ПоляТаблицы = ПоляТаблицы + ?(ПоляТаблицы <> "", ",", "") + Символы.ПС + Символы.Таб + Колонка.Имя;
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ПоляТаблицы>", ПоляТаблицы);
	
	ПоляСортировки = "";
	
	Для Каждого Строка Из Сортировка Цикл
		
		Если ЗначениеЗаполнено(Строка.Поле) Тогда
			ПоляСортировки = ПоляСортировки + ?(ПоляСортировки <> "", ",", "") + Символы.ПС + Символы.Таб + "_ТаблицаОтчетов." + Строка.Поле + ?(Строка.Порядок, " УБЫВ", "");
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПоляСортировки = "" Тогда
		ПоляСортировки = ПоляСортировки + Символы.ПС + Символы.Таб + "_ТаблицаОтчетов.ИсходныйПорядковыйНомер";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ПоляСортировки>", ПоляСортировки);
	
	ОтсортированнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	СоставОтчетов.ПолучитьЭлементы().Очистить();
	
	Для Каждого Строка Из ОтсортированнаяТаблица Цикл
		ЗаполнитьЗначенияСвойств(СоставОтчетов.ПолучитьЭлементы().Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти
